Revit 2024 API
PolymeshTopology.GetPoints Method
 Returns all points of the polymesh.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public IList<XYZ> GetPoints()
Visual Basic
Public Function GetPoints As IList(Of XYZ)
Visual C++
public:
IList<XYZ^>^ GetPoints()
Return Value
 An array of XYZ coordinates
See Also
PolymeshTopology Class
Autodesk.Revit.DB Namespace